In [2]:
import pandas as pd

In [5]:
df = pd.read_csv("log6a.log",sep="\t")

In [6]:
df

     T1(onheater):27.08  T2: 26.67  T3(Outside): 23.0000    265.00
0    T1(onheater):27.04  T2: 26.67  T3(Outside): 23.0000    1530.0
1    T1(onheater):27.08  T2: 26.67  T3(Outside): 23.0000    2795.0
2    T1(onheater):27.08  T2: 26.67  T3(Outside): 23.0000    4061.0
3    T1(onheater):27.12  T2: 26.67  T3(Outside): 23.0000    5325.0
4    T1(onheater):27.16  T2: 26.71  T3(Outside): 23.0000    6591.0
..                  ...        ...                   ...       ...
523  T1(onheater):27.04  T2: 26.63  T3(Outside): 23.5000  663241.0
524  T1(onheater):26.99  T2: 26.59  T3(Outside): 23.0000  664507.0
525  T1(onheater):27.04  T2: 26.59  T3(Outside): 23.5000  665772.0
526  T1(onheater):27.04  T2: 26.59  T3(Outside): 23.5000  667037.0
527  T1(onheater):26.99  T2: 26.59  T3(Outside): 23.5000  668302.0

[528 rows x 4 columns]